# Query

```
DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName has_any ("cmd.exe","powershell.exe")
| where ProcessCommandLine contains "reg add"
| where ProcessCommandLine contains "reg query"
| where ProcessCommandLine contains "Winlogon"
| project Timestamp, DeviceName, AccountName
```
