# Query

```
DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName == "powershell.exe"
| where ProcessCommandLine contains "Get-ChildItem"
| where ProcessCommandLine contains "-Recurse"
| where ProcessCommandLine contains "pass"
| where ProcessCommandLine contains "secret"
| where ProcessCommandLine contains "password"
| where ProcessCommandLine contains "pwd"
```
