# Query

```
DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName has_any ("cmd.exe","powershell.exe")
| where ProcessCommandLine contains "reg add HKLM"
| where ProcessCommandLine contains "lsa"
| where ProcessCommandLine contains "mimilib"
| where ProcessCommandLine  contains "tspkg"
| where ProcessCommandLine contains "query"
| where ProcessCommandLine contains "kiwissp.log"
| where ProcessCommandLine contains "mimilsa.log"
| project Timestamp, DeviceName, AccountName

```
