# Query

```
DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName has_any ("powershell.exe","cmd.exe")
| where ProcessCommandLine has_any ("PasswordVault","Credentials","RetrievePassword","Web-Credentials","logonpasswords")
| project DeviceName, AccountName, ProcessCommandLine
```
