# Query

```
DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName contains "net.exe"
| where ProcessCommandLine has_any ("net user","/add")
| project Timestamp,DeviceName, ProcessCommandLine
```
