// Detects when any binaries are dropped that can be abused to exfiltrate credentials 

# Query

DeviceProcessEvents
| where InitiatingProcessVersionInfoOriginalFileName has_any ("mimikatz.exe", "procdump.exe", "pwdump.exe","pwdump7.exe", "lazagne.exe", "FakeLogonScreen.exe", "SharpLocker.exe")
| project Timestamp, DeviceName, AccountName, DeviceId, ReportId
