// Detects when any user/service account is authenticating over the networking using clear-text credentials.

# Query

DeviceLogonEvents 
| where LogonType == "NetworkCleartext"
| project Timestamp, DeviceName, ActionType, LogonType, AccountName, InitiatingProcessAccountName, InitiatingProcessFolderPath

