// Detects when a PowerShell credential object is created

# Query

DeviceProcessEvents
| where InitiatingProcessFileName has_any ("cmd.exe", "powershell.exe", "wscript.exe", "cscript.exe")
| where ProcessCommandLine has_any ("-AsPlainText", "securestring")
